{"compress":true,"commitItems":[["85a44f23-585e-4a08-9610-f1a1b136f49a",1508151911941,"---\ntitle: 写一篇流水账吧\ndate: 2017-10-15 21:20:21\ntags:\n- 随笔\n- 总结\n---\n\n先记录一下动笔的时间吧：**2017年10月15日20:26** 。本来是打算写一篇技术类的文的，捯饬了半天发现都是很多凌乱的东西，完全不知道从哪里写起，但是又决定一定要写点什么（拖延症太可怕T^T），最终决定先写点简单的——一个被叫做流水账的东西。因为太久没有好好写过东西，所以逻辑混乱，准备顺着时间线来写，也权当是对这已经过去的不算平凡的一大段时间的总结吧。\n\n\n\n### 从2016年的12月24号说起\n\n对于考研的场景已经没有太多的印象，只记得那两天的天不太好，阴冷潮湿，见不到太阳。考试结束后没有想象中的如释重负，也没有悲伤到情难自禁，平淡的仿佛什么都没有发生过。当然，见到成绩以后是略带悲伤的，虽然也在意料之中。\n\n### 大学的最后一个寒假以及农历新年\n\n直到碰见了某些节点，才会感叹时间过得真快啊。时间无情，我这破记忆也不靠谱，那个假期，那个新年发生了什么，脑海中几乎完全没有印象。想不起一件轮廓清晰的事情，连年夜饭桌上的丁点模糊记忆也没有留下。所以啊，是要写点什么的，如某鱼所说，总得留下点什么，证明自己来过。\n\n嗯，突然想起来一件算是比较重大的事情，经历了重重磨难，终于拿下了驾照……原来我的最后一个假期是用来练车了，关于练车的这些破事真的是不想再想，不过有些人，有些感激不能忘。\n\n### 这次开学就快要毕业了啊\n\n大学的最后一个学期，也是最忙碌的一个学期。找过工作，做了毕设（突然想到毕设的内容可以总结一下，说不定能有产出呢），侥幸最终还能再读几年书；错过了班级的毕业照，跑着撂掉书包的刹那，看到同学们抛出的帽子，随着毕业快乐的喊声一点点变淡小变淡直到消失……\n\n给自己拍了毕业照，摄影技能算是没有白点，想到一些照片，嗯，还是有点点开心的。\n\n**2017年6月25日** ，至此13各天涯，不负17好年华。\n\n### 新的开始\n\n对这个新旧更替的暑假还是有些印象的，去了一些地方，拍了一些照片，然后成功入驻教研室，开始了忙碌但感觉还不错的生活。以及，开始了某乐器的学习。最近在**Coursera**上面学的一门课程*Learning how to learn*里面有说到\n\n> Lady luck favors the one who tries. Just focus on whatever section you're studying. You'll find that once you put that first problem or concept in your mental library, whatever it is, then the second concept will go in a little more easily. And the third more easily still. Not that all of this is a snap, but it does get easier.\n\n所以喜欢什么，去学就好了，想做什么，去做就好了。尝试使人更幸运。\n\n### 来个附录\n\n统计一波关键词，看看有没有什么值得整理记录的主题：\n\n毕设：PageRank  Lucene  Networkx  spyder  XML  elasticsearch  tomcat\n\n博客：flask  django  npm  hexo  jekyll  nginx  apache  http server\n\n匿名p2p：Freenet  Fcp  I2P  Tor  small_world_network  ant gradle \n\nc/c++：point  struct  class  overload  override  构造函数  拷贝构造函数  析构函数  \n\n数据结构和算法：链表 二分法  动态规划  贪心算法\n\npython：numpy  Theano  os\n\n",[[1508151897040,["xaut@xaut-PC",[[1,735,"感觉好像有什么东西"]],[735,735],[744,744]]],[1508151927386,["xaut@xaut-PC",[[-1,732,"帽子"]],[734,734],[732,732]]],[1508151929376,["xaut@xaut-PC",[[1,732,"学士帽"]],[732,732],[735,735]]],[1508151938955,["xaut@xaut-PC",[[1,747,"“"]],[747,747],[748,748]]],[1508151940689,["xaut@xaut-PC",[[1,752,"”"]],[752,752],[753,753]]],[1508151947583,["xaut@xaut-PC",[[1,764,"，"]],[764,764],[765,765]]]]]]}